nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/cmsis_driver_examples/enet/txrx_transfer/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : ENET0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void ENET0_InitPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTB4 (pin 41) is configured as MII_RMII_MDIO */
    PORT_SetPinMux(PORTB, 4U, kPORT_MuxAlt5);

    PORTB->PCR[4] = ((PORTB->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTC0 (pin 53) is configured as MII_RMII_RXD1 */
    PORT_SetPinMux(PORTC, 0U, kPORT_MuxAlt4);

    /* PORTC1 (pin 52) is configured as MII_RMII_RXD0 */
    PORT_SetPinMux(PORTC, 1U, kPORT_MuxAlt5);

    /* PORTC17 (pin 56) is configured as MII_RMII_RX_DV */
    PORT_SetPinMux(PORTC, 17U, kPORT_MuxAlt5);

    /* PORTC2 (pin 43) is configured as MII_RMII_TXD0 */
    PORT_SetPinMux(PORTC, 2U, kPORT_MuxAlt5);

    /* PORTD11 (pin 48) is configured as MII_RMII_TX_CLK */
    PORT_SetPinMux(PORTD, 11U, kPORT_MuxAlt5);

    /* PORTD12 (pin 47) is configured as MII_RMII_TX_EN */
    PORT_SetPinMux(PORTD, 12U, kPORT_MuxAlt5);

    /* PORTD7 (pin 44) is configured as MII_RMII_TXD1 */
    PORT_SetPinMux(PORTD, 7U, kPORT_MuxAlt5);

    /* PORTE8 (pin 39) is configured as MII_RMII_MDC */
    PORT_SetPinMux(PORTE, 8U, kPORT_MuxAlt5);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : ENET0_DeinitPins
 * Description   : This is a de-initialization function for 'ENET0_InitPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void ENET0_DeinitPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port B */
        PORTB,
        /* Digital filter is configured for PORTB0 */
        PORT_DFER_DFE_4_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t portb4_pin41_config = {/* Internal pull-up/down resistor is disabled */
                                                   kPORT_PullDisable,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is disabled */
                                                   kPORT_PinDisabledOrAnalog,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   kPORT_UnlockRegister};
    /* PORTB4 (pin 41) is disabled */
    PORT_SetPinConfig(PORTB, 4U, &portb4_pin41_config);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port C */
        PORTC,
        /* Digital filter is configured for PORTC0 */
          PORT_DFER_DFE_0_MASK
            /* Digital filter is configured for PORTC1 */
            | PORT_DFER_DFE_1_MASK
            /* Digital filter is configured for PORTC2 */
            | PORT_DFER_DFE_2_MASK
            /* Digital filter is configured for PORTC3 */
            | PORT_DFER_DFE_17_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t portc0_pin53_config = {/* Internal pull-up/down resistor is disabled */
                                                   kPORT_PullDisable,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as ADC0_SE8 */
                                                   kPORT_PinDisabledOrAnalog,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   kPORT_UnlockRegister};
    /* PORTC0 (pin 53) is configured as ADC0_SE8 */
    PORT_SetPinConfig(PORTC, 0U, &portc0_pin53_config);

    const port_pin_config_t portc1_pin52_config = {/* Internal pull-up/down resistor is disabled */
                                                   kPORT_PullDisable,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as ADC0_SE9 */
                                                   kPORT_PinDisabledOrAnalog,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   kPORT_UnlockRegister};
    /* PORTC1 (pin 52) is configured as ADC0_SE9 */
    PORT_SetPinConfig(PORTC, 1U, &portc1_pin52_config);

    const port_pin_config_t portc17_pin56_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as ADC0_SE15 */
                                                    kPORT_PinDisabledOrAnalog,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORTC17 (pin 56) is configured as ADC0_SE15 */
    PORT_SetPinConfig(PORTC, 17U, &portc17_pin56_config);

    const port_pin_config_t portc2_pin43_config = {/* Internal pull-up/down resistor is disabled */
                                                   kPORT_PullDisable,
                                                   /* Passive filter is disabled */
                                                   kPORT_PassiveFilterDisable,
                                                   /* Low drive strength is configured */
                                                   kPORT_LowDriveStrength,
                                                   /* Pin is configured as ADC0_SE10, CMP0_IN5 */
                                                   kPORT_PinDisabledOrAnalog,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   kPORT_UnlockRegister};
    /* PORTC2 (pin 43) is configured as ADC0_SE10, CMP0_IN5 */
    PORT_SetPinConfig(PORTC, 2U, &portc2_pin43_config);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port D */
        PORTD,
        /* Digital filter is configured for PORTD0 */
          PORT_DFER_DFE_7_MASK
            /* Digital filter is configured for PORTD1 */
            | PORT_DFER_DFE_11_MASK
            /* Digital filter is configured for PORTD2 */
            | PORT_DFER_DFE_12_MASK,
        /* Disable digital filter */
        false);

